/*
		함수[함 : 상자 ]
			- 상자 안에 들어있는 수/코드
			- 누군가 가 미리 상자에 넣어둔 수/코드
			- 미리 정의[만들어진]된 수/코드 !!!!!!!
		1.functoin=  함수 /행동/ 이벤트 내용물
		2. 하나의 특별한 목적의 작업을 수행하기 위한 독립적인 코드의 집합
		3. 사용 모목적
			1. 재활용성/재사용 : 한번 저으이[만들기] 하면 반복적으로 사용 가능
			2. 인수[매게변수]/반환[리턴] : 인수에 따른 서로 다른 반환값 얻음
					- 인수[매게변수] : 함수 안으로 들어가는 수/코드			
					- 반환[리턴] :  함수 밖으로 나오는 수/코드
						ex)
							더하기함수{x+y}		[1. 함수 정의]
							더하기함수(3 ,5)		[2. 함수에 인수전달]
							함수변환=8				[3. 함수 실행 결과]
		
					
		
			3. 메모리 효율성 높일수 있다.
				- 함수 { } 안에서 '{' 시작 되고 '}' 끝나면 메모리/코드 다 사라짐
				- 지역변수 : { } 안에서 선언된 메모리는 { } 밖으로 못나감
				- 전역변수 : { }  없는곳에서 선언된 메모리
					*메모리 : 변수/상수/배열/객체 등등
					* 메모리 증가 -> 속도 감소 -> 개발비 증가
*/ 