package 과제.과제8;

// 목적 : 실행
public class MemberSys {
	
}


/*
			주제 : 회원제 시스템
			0. 저장
				아이디,비밀번호 , 이름 , 전화번호
				* 5가지(서로가진타입) 필드 /변수 / 데이터 를 하나의 묶음방법
				--> 문자열 이용 : "아이디, 비밀번호, 이름 , 전화번호,나이"	: , 수미표 이용한 필드 구분
				--> 클래스(필드) 이용	: 
					1. 클래스 설계 = 새로운 클래스.java 파일 생성
					2. 클래스 맴버 구성 : 필드 ,생성자 ,메소드
				* 하나로 묶인 (기준동일 = 타입동일) 여ㅑ러개 저장
				---> 문자열 배열 : String[] 문자열배열 = new String[100];
				---> 클래스 배열 : Member[] 객체배열 = new Member[100];
				
			0. 초기 메뉴
				1. 회원가입	2. 로그인
				
			1. 조건 기능
				1. 회원가입
				2. 로그인
				
			
			
			
			
*/